# ConvertSplineToLineFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..ConvertSplineToLineFailed Property
BuiltInFailures..::..SketchFailures Class See Also
---
Failed to convert spline to straight line
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ConvertSplineToLineFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConvertSplineToLineFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ConvertSplineToLineFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace